{
    "Spells": [
    
        
            
        {
            "name": "Acid Arrow",
            "level": 1,
            "range": 90,
            "castingTime": 1,
            "castingActionType":"action",
            "duration":"Instantaneous",
            "damageDiceQty": 4,
            "damageDiceAmount": 4,
            "save": "None",
            "attackType":"Ranged spell attack",
            "fluffDescription": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid.",
            "mechanicalDescription":" Make a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage immediately and 2d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.",
            "higherCast": "When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 1d4 for each slot level above 2nd."
        },

        {
            "name": "Acid Splash",
            "level": 0,
            "range": 60,
            "castingTime": 1,
            "castingActionType":"action",
            "duration":"Instantaneous",
            "damageDiceQty": 1,
            "damageDiceAmount": 6,
            "save": "DEX",
            "attackType":"Ranged spell attack",
            "fluffDescription": "You hurl a bubble of acid and it makes a wet pop on impact.",
            "mechanicalDescription":"Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d6 acid damage",
            "higherCast": "This spell’s damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
        },

        {
            "name": "Burning Hands",
            "level": 1,
            "range": 15,
            "castingTime": 1,
            "castingActionType":"action",
            "duration":"Instantaneous",
            "damageDiceQty": 3,
            "damageDiceAmount": 6,
            "save": "DEX",
            "attackType":"Self (15ft Cone)",
            "fluffDescription": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips.",
            "mechanicalDescription":"Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren't being worn or carried.",
            "higherCast": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st"
        },

        {
            "name": "Chain Lightning",
            "level": 6,
            "range": 150,
            "castingTime": 1,
            "castingActionType":"action",
            "duration":"Instantaneous",
            "damageDiceQty": 10,
            "damageDiceAmount": 8,
            "save": "DEX",
            "attackType":"Auto-Hit",
            "fluffDescription": "Static discharges dance around your whole body as you extend your hand forwards. A bright bolt of lightning erupts from your palm, ringing your ears.",
            "mechanicalDescription":"Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts. A target must DEX save. Target takes 10d8 lightning damage on a failed save, half damage on a successful one. ",
            "higherCast": "When you cast this spell using a spell slot of 7th level or higher, one additional bolt leaps from the first target to another target for each slot level above 6th. "
        },

        {
            "name": "Power Word Kill",
            "level": 9,
            "range": 60,
            "castingTime": 1,
            "castingActionType":"action",
            "duration":"Instantaneous",
            "damageDiceQty": 10,
            "damageDiceAmount": 10,
            "save": "None",
            "attackType":"Auto-Hit",
            "fluffDescription": "Your voice brims with deadly power. You utter a fathomless word and the target is compelled to instantly die. ",
            "mechanicalDescription":"If the creature you choose has 100 hit points or fewer, it dies. Otherwise, the spell has no effect.",
            "higherCast": "This spell does not have a higher cast."
        }
    ]

}